[
  {
    "title": "CFIReview",
    "description": "CFIReview is a Review Website for Flying Instructors. I developed this website for an Upwork client, she wanted custom designs and a fully responsive site. This site was developed using ReactJS, NodeJS, Mongo, SCSS, Ant Design and some 3rd party npm packages",
    "image": "/images/cfireview.png",
    "links": [
      {
        "name": "View",
        "url": "https://www.cfireview.com"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/burhanmaseel/cfireview"
      }
    ],
    "tags": [
      "TypeScript",
      "ReactJS",
      "ReactJS Quill",
      "Axios",
      "AntD",
      "SCSS",
      "NodeJS",
      "ExpressJS",
      "Nginx"
    ]
  },
  {
    "title": "Airokit",
    "image": "/images/airokit.png",
    "description": "Airokit is a ReactJS based component library developed for Afiniti. Airokit was built using ReactJS, SCSS, Custom Grid System, Responsive Design, White/Dark Theme, Rollup, Storybook, Jest, Custom NPM Proxy and some third-party applications. Airokit consists of every User Interface Component required to develop a User Interface. Used Docker to deploy Storybook and published to Afiniti's custom proxy",
    "tags": [
      "ReactJS",
      "Jest",
      "ES6",
      "TypeScript",
      "SCSS",
      "Storybook",
      "RollUp",
      "Material",
      "NPM"
    ]
  },
  {
    "title": "Oversight",
    "image": "/images/over.png",
    "description": "Oversight is a monitoring system developed to monitor statistics RAM Usage, CPU Utilization, AI Utilization, Disk Utilization and much more performance related statistics. The first version was developed using ReactJS, Redux, SCSS, NodeJS, MongoDB, Redis, the second version was developed using the same UI as version one but with Golang at the server side, the third and final version was built using JAVA, Spring boot, SNMP and MongoDB.",
    "tags": [
      "ReactJS",
      "Redux",
      "ES6",
      "TypeScript",
      "SCSS",
      "SNMP",
      "JAVA",
      "NodeJS",
      "Golang",
      "MongoDB",
      "NPM"
    ]
  },
  {
    "title": "Oversight Signals Manager",
    "image": "/images/oversm.png",
    "description": "Oversight Signals Manager (OSM) is a signal management system that organizes and provides the ability to Create, Read, Update and Delete configurations for each sensor used in Oversight such as performance statistics i.e., CPU Utilization. OSM was developed using ReactJS, Apollo Client, Ant Design, SCSS, UseForm, Hasura, GraphQL and PostgreSQL.",
    "tags": [
      "ReactJS",
      "Apollo Client",
      "ES6",
      "TypeScript",
      "USeForm",
      "SCSS",
      "AntD",
      "Hasura",
      "GraphQL",
      "PostgreSQL",
      "NPM"
    ]
  },
  {
    "title": "The Seek",
    "image": "/images/seek.png",
    "description": "The Seek is a Machine Learning based CCTV Surveillance System, developed this project using ReactJS, SCSS, Ant Design, Python, Python Flask, PyMongo, NumPy, Tensor-flow, Keras, Open-CV and Nvidia CUDA. This project captures CCTV Feed using Device IP Address, runs an activity and an object detection model to detect suspicious activity, weapons and notify administration. The suspicious part is also recorded and stored for admin to review or use later. Demo can be provided upon request.",
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/Zunaib/seek"
      }
    ],
    "tags": [
      "ReactJS",
      "JavaScript",
      "SCSS",
      "AntD",
      "Python",
      "Python Flask",
      "PyMongo",
      "Tensorflow",
      "Keras",
      "Open-CV",
      "NumPy",
      "CUDA Tools"
    ]
  },
  {
    "title": "Vogue Junction",
    "image": "/images/vogue.png",
    "description": "Vogue Junction is one of my own projects. The idea behind vogue junction is to combine the functionalities of an e-commerce site with the likes of YouTube, Instagram and Medium. Specially designed for Fashion Freelancers to showcase and sell their work exclusively. This site was developed using ReactJS, NodeJS, Mongo and purely custom designed theme in SCSS.",
    "links": [
      {
        "name": "GitHub UI",
        "url": "https://github.com/Zunaib/vj_2.0-react"
      },
      {
        "name": "Server",
        "url": "https://github.com/Zunaib/vj_2.0"
      }
    ],
    "tags": [
      "ReactJS",
      "Redux",
      "ES6",
      "JavaScript",
      "CSS",
      "Material UI",
      "NodeJS",
      "ExpressJS",
      "PassportJS",
      "CORS",
      "MongoDB"
    ]
  },
  {
    "title": "POS",
    "image": "/images/pos.png",
    "description": "Developed numerous Point of Sale Systems for Local Clients and University Projects. These POS Systems consisted of data management, task scheduling, billing systems and some sale points were built on different stacks with the likes of PHP, NodeJS, ReactJS,  Angular, CSS, MongoDB, SQL",

    "tags": [
      "ReactJS",
      "Redux",
      "JavaScript",
      "PHP",
      "NodeJS",
      "ExpressJS",
      "MongoDB",
      "SQL",
      "ReduxJS",
      "CSS"
    ]
  },
  {
    "title": "Our Family Tales",
    "description": "Our Family Tales is a Story Telling Website. I developed this site for an Upwork client too, she wanted a fully customizable questionnaire built into a new Shopify store, I did both to those things using some of shopify’ s built-in functionalities, Vanilla Java-script and SCSS.",
    "links": [
      {
        "name": "View",
        "url": "https://ourfamilytales.co/"
      }
    ],
    "tags": ["Ruby", "JQuery", "Shopify", "SCSS", "Vanilla JS"]
  }
]
